DeviceEvents
| where DeviceName == "vm-soc-lab-01"
| where Timestamp > ago(24h)
| where ActionType in (
    "UserAccountAddedToLocalGroup",
    "UserAccountCreated",
    "UserAccountModified"
)
| project 
    Timestamp,
    ActionType,
    AccountName,
    InitiatingProcessAccountName,
    InitiatingProcessFileName,
    InitiatingProcessCommandLine,
    AdditionalFields
| order by Timestamp asc
