// Brute Force Detection
// MITRE: T1110.001 - Password Guessing
// Table: DeviceLogonEvents

DeviceLogonEvents
| where DeviceName == "vm-soc-lab-01"
| where Timestamp > ago(24h)
| where ActionType == "LogonFailed"
| summarize 
    TotalAttempts = count(),
    FirstAttempt  = min(Timestamp),
    LastAttempt   = max(Timestamp),
    UsersTried    = make_set(AccountName),
    SourceIPs     = make_set(RemoteIP)
    by RemoteIP, RemoteIPType
| where TotalAttempts >= 5
| extend AttackDuration = LastAttempt - FirstAttempt
| order by TotalAttempts desc
